reports/benchmark/nvidia_h100/MiniMax-M2.5/test_04/01/1-300-i70000-o1500/bench-test_04-1-300-i70000-o1500.log
INFO 04-30 19:53:52 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 04-30 19:53:52 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7faa3c3ac2c0>, trust_remote_code=True, seed=123, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=70000, random_output_len=1500, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='/userdata/llms/MiniMax/MiniMax-M2.5', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='95,99', goodput=None, request_id_prefix='bench-91936c92-', top_p=None, top_k=None, min_p=None, temperature=0.7, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='minimax-m2.5', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=30, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 04-30 19:53:53 [utils.py:90] Sampling input_len from [70000, 70000] and output_len from [1500, 1500]
Starting initial single prompt test run...
Waiting for endpoint to become up in 30 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 00:15 elapsed, 127:20:39 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/300 [00:00<?, ?it/s]
  0%|          | 1/300 [00:13<1:08:44, 13.79s/it]
  1%|          | 2/300 [00:29<1:14:10, 14.93s/it]
  1%|          | 3/300 [00:45<1:15:41, 15.29s/it]
  1%|▏         | 4/300 [01:00<1:16:15, 15.46s/it]
  2%|▏         | 5/300 [01:16<1:16:28, 15.55s/it]
  2%|▏         | 6/300 [01:32<1:16:30, 15.61s/it]
  2%|▏         | 7/300 [01:48<1:16:28, 15.66s/it]
  3%|▎         | 8/300 [02:03<1:16:16, 15.67s/it]
  3%|▎         | 9/300 [02:19<1:16:06, 15.69s/it]
  3%|▎         | 10/300 [02:35<1:15:56, 15.71s/it]
  4%|▎         | 11/300 [02:51<1:15:43, 15.72s/it]
  4%|▍         | 12/300 [03:06<1:15:27, 15.72s/it]
  4%|▍         | 13/300 [03:22<1:15:13, 15.72s/it]
  5%|▍         | 14/300 [03:38<1:14:56, 15.72s/it]
  5%|▌         | 15/300 [03:54<1:14:42, 15.73s/it]
  5%|▌         | 16/300 [04:09<1:14:27, 15.73s/it]
  6%|▌         | 17/300 [04:25<1:14:11, 15.73s/it]
  6%|▌         | 18/300 [04:41<1:13:56, 15.73s/it]
  6%|▋         | 19/300 [04:56<1:13:40, 15.73s/it]
  7%|▋         | 20/300 [05:12<1:13:23, 15.73s/it]
  7%|▋         | 21/300 [05:28<1:13:06, 15.72s/it]
  7%|▋         | 22/300 [05:44<1:12:50, 15.72s/it]
  8%|▊         | 23/300 [05:59<1:12:35, 15.72s/it]
  8%|▊         | 24/300 [06:15<1:12:20, 15.73s/it]
  8%|▊         | 25/300 [06:31<1:12:06, 15.73s/it]
  9%|▊         | 26/300 [06:47<1:11:54, 15.75s/it]
  9%|▉         | 27/300 [07:02<1:11:36, 15.74s/it]
  9%|▉         | 28/300 [07:18<1:11:20, 15.74s/it]
 10%|▉         | 29/300 [07:34<1:11:07, 15.75s/it]
 10%|█         | 30/300 [07:50<1:10:50, 15.74s/it]
 10%|█         | 31/300 [08:05<1:10:36, 15.75s/it]
 11%|█         | 32/300 [08:21<1:10:18, 15.74s/it]
 11%|█         | 33/300 [08:37<1:10:01, 15.74s/it]
 11%|█▏        | 34/300 [08:52<1:09:42, 15.72s/it]
 12%|█▏        | 35/300 [09:08<1:09:27, 15.73s/it]
 12%|█▏        | 36/300 [09:24<1:09:16, 15.75s/it]
 12%|█▏        | 37/300 [09:40<1:08:58, 15.74s/it]
 13%|█▎        | 38/300 [09:55<1:08:42, 15.73s/it]
 13%|█▎        | 39/300 [10:11<1:08:27, 15.74s/it]
 13%|█▎        | 40/300 [10:27<1:08:10, 15.73s/it]
 14%|█▎        | 41/300 [10:43<1:07:55, 15.74s/it]
 14%|█▍        | 42/300 [10:58<1:07:37, 15.73s/it]
 14%|█▍        | 43/300 [11:14<1:07:21, 15.73s/it]
 15%|█▍        | 44/300 [11:30<1:07:05, 15.72s/it]
 15%|█▌        | 45/300 [11:45<1:06:49, 15.72s/it]
 15%|█▌        | 46/300 [12:01<1:06:35, 15.73s/it]
 16%|█▌        | 47/300 [12:17<1:06:17, 15.72s/it]
 16%|█▌        | 48/300 [12:33<1:06:01, 15.72s/it]
 16%|█▋        | 49/300 [12:48<1:05:46, 15.72s/it]
 17%|█▋        | 50/300 [13:04<1:05:30, 15.72s/it]
 17%|█▋        | 51/300 [13:20<1:05:17, 15.73s/it]
 17%|█▋        | 52/300 [13:36<1:04:59, 15.72s/it]
 18%|█▊        | 53/300 [13:51<1:04:44, 15.73s/it]
 18%|█▊        | 54/300 [14:07<1:04:27, 15.72s/it]
 18%|█▊        | 55/300 [14:23<1:04:11, 15.72s/it]
 19%|█▊        | 56/300 [14:38<1:03:57, 15.73s/it]
 19%|█▉        | 57/300 [14:54<1:03:41, 15.72s/it]
 19%|█▉        | 58/300 [15:10<1:03:27, 15.73s/it]
 20%|█▉        | 59/300 [15:26<1:03:11, 15.73s/it]
 20%|██        | 60/300 [15:41<1:02:55, 15.73s/it]
 20%|██        | 61/300 [15:57<1:02:38, 15.73s/it]
 21%|██        | 62/300 [16:13<1:02:21, 15.72s/it]
 21%|██        | 63/300 [16:29<1:02:07, 15.73s/it]
 21%|██▏       | 64/300 [16:44<1:01:52, 15.73s/it]
 22%|██▏       | 65/300 [17:00<1:01:35, 15.73s/it]
 22%|██▏       | 66/300 [17:16<1:01:19, 15.72s/it]
 22%|██▏       | 67/300 [17:31<1:01:03, 15.72s/it]
 23%|██▎       | 68/300 [17:47<1:00:46, 15.72s/it]
 23%|██▎       | 69/300 [18:03<1:00:31, 15.72s/it]
 23%|██▎       | 70/300 [18:19<1:00:15, 15.72s/it]
 24%|██▎       | 71/300 [18:34<1:00:01, 15.73s/it]
 24%|██▍       | 72/300 [18:50<59:49, 15.74s/it]  
 24%|██▍       | 73/300 [19:06<59:34, 15.75s/it]
 25%|██▍       | 74/300 [19:22<59:18, 15.74s/it]
 25%|██▌       | 75/300 [19:37<59:03, 15.75s/it]
 25%|██▌       | 76/300 [19:53<58:42, 15.73s/it]
 26%|██▌       | 77/300 [20:09<58:25, 15.72s/it]
 26%|██▌       | 78/300 [20:24<58:10, 15.72s/it]
 26%|██▋       | 79/300 [20:40<57:55, 15.73s/it]
 27%|██▋       | 80/300 [20:56<57:42, 15.74s/it]
 27%|██▋       | 81/300 [21:12<57:27, 15.74s/it]
 27%|██▋       | 82/300 [21:27<57:10, 15.74s/it]
 28%|██▊       | 83/300 [21:43<56:55, 15.74s/it]
 28%|██▊       | 84/300 [21:59<56:38, 15.73s/it]
 28%|██▊       | 85/300 [22:15<56:20, 15.72s/it]
 29%|██▊       | 86/300 [22:30<56:04, 15.72s/it]
 29%|██▉       | 87/300 [22:46<55:51, 15.74s/it]
 29%|██▉       | 88/300 [23:02<55:33, 15.73s/it]
 30%|██▉       | 89/300 [23:18<55:16, 15.72s/it]
 30%|███       | 90/300 [23:33<55:02, 15.73s/it]
 30%|███       | 91/300 [23:49<54:47, 15.73s/it]
 31%|███       | 92/300 [24:05<54:32, 15.73s/it]
 31%|███       | 93/300 [24:20<54:16, 15.73s/it]
 31%|███▏      | 94/300 [24:36<53:59, 15.72s/it]
 32%|███▏      | 95/300 [24:52<53:42, 15.72s/it]
 32%|███▏      | 96/300 [25:08<53:29, 15.73s/it]
 32%|███▏      | 97/300 [25:23<53:14, 15.74s/it]
 33%|███▎      | 98/300 [25:39<52:58, 15.74s/it]
 33%|███▎      | 99/300 [25:55<52:41, 15.73s/it]
 33%|███▎      | 100/300 [26:11<52:25, 15.73s/it]
 34%|███▎      | 101/300 [26:26<52:10, 15.73s/it]
 34%|███▍      | 102/300 [26:42<51:54, 15.73s/it]
 34%|███▍      | 103/300 [26:58<51:39, 15.73s/it]
 35%|███▍      | 104/300 [27:14<51:25, 15.74s/it]
 35%|███▌      | 105/300 [27:29<51:09, 15.74s/it]
 35%|███▌      | 106/300 [27:45<50:50, 15.73s/it]
 36%|███▌      | 107/300 [28:01<50:38, 15.74s/it]
 36%|███▌      | 108/300 [28:16<50:22, 15.74s/it]
 36%|███▋      | 109/300 [28:32<50:06, 15.74s/it]
 37%|███▋      | 110/300 [28:48<49:49, 15.74s/it]
 37%|███▋      | 111/300 [29:04<49:33, 15.74s/it]
 37%|███▋      | 112/300 [29:19<49:16, 15.73s/it]
 38%|███▊      | 113/300 [29:35<49:00, 15.73s/it]
 38%|███▊      | 114/300 [29:51<48:46, 15.73s/it]
 38%|███▊      | 115/300 [30:07<48:29, 15.73s/it]
 39%|███▊      | 116/300 [30:22<48:12, 15.72s/it]
 39%|███▉      | 117/300 [30:38<47:58, 15.73s/it]
 39%|███▉      | 118/300 [30:54<47:42, 15.73s/it]
 40%|███▉      | 119/300 [31:10<47:27, 15.73s/it]
 40%|████      | 120/300 [31:25<47:10, 15.72s/it]
 40%|████      | 121/300 [31:41<46:56, 15.73s/it]
 41%|████      | 122/300 [31:57<46:39, 15.73s/it]
 41%|████      | 123/300 [32:12<46:23, 15.72s/it]
 41%|████▏     | 124/300 [32:28<46:07, 15.72s/it]
 42%|████▏     | 125/300 [32:44<45:52, 15.73s/it]
 42%|████▏     | 126/300 [33:00<45:36, 15.73s/it]
 42%|████▏     | 127/300 [33:15<45:20, 15.73s/it]
 43%|████▎     | 128/300 [33:31<45:04, 15.73s/it]
 43%|████▎     | 129/300 [33:47<44:50, 15.73s/it]
 43%|████▎     | 130/300 [34:02<44:34, 15.73s/it]
 44%|████▎     | 131/300 [34:18<44:18, 15.73s/it]
 44%|████▍     | 132/300 [34:34<44:02, 15.73s/it]
 44%|████▍     | 133/300 [34:50<43:46, 15.73s/it]
 45%|████▍     | 134/300 [35:05<43:31, 15.73s/it]
 45%|████▌     | 135/300 [35:21<43:15, 15.73s/it]
 45%|████▌     | 136/300 [35:37<42:58, 15.72s/it]
 46%|████▌     | 137/300 [35:53<42:43, 15.72s/it]
 46%|████▌     | 138/300 [36:08<42:26, 15.72s/it]
 46%|████▋     | 139/300 [36:24<42:11, 15.72s/it]
 47%|████▋     | 140/300 [36:40<41:56, 15.73s/it]
 47%|████▋     | 141/300 [36:55<41:40, 15.73s/it]
 47%|████▋     | 142/300 [37:11<41:24, 15.72s/it]
 48%|████▊     | 143/300 [37:27<41:09, 15.73s/it]
 48%|████▊     | 144/300 [37:43<40:54, 15.73s/it]
 48%|████▊     | 145/300 [37:58<40:39, 15.74s/it]
 49%|████▊     | 146/300 [38:14<40:22, 15.73s/it]
 49%|████▉     | 147/300 [38:30<40:07, 15.74s/it]
 49%|████▉     | 148/300 [38:46<39:51, 15.73s/it]
 50%|████▉     | 149/300 [39:01<39:34, 15.72s/it]
 50%|█████     | 150/300 [39:17<39:18, 15.72s/it]
 50%|█████     | 151/300 [39:33<39:02, 15.72s/it]
 51%|█████     | 152/300 [39:48<38:46, 15.72s/it]
 51%|█████     | 153/300 [40:04<38:31, 15.73s/it]
 51%|█████▏    | 154/300 [40:20<38:15, 15.72s/it]
 52%|█████▏    | 155/300 [40:36<38:00, 15.73s/it]
 52%|█████▏    | 156/300 [40:51<37:45, 15.73s/it]
 52%|█████▏    | 157/300 [41:07<37:28, 15.73s/it]
 53%|█████▎    | 158/300 [41:23<37:12, 15.72s/it]
 53%|█████▎    | 159/300 [41:39<36:56, 15.72s/it]
 53%|█████▎    | 160/300 [41:54<36:41, 15.72s/it]
 54%|█████▎    | 161/300 [42:10<36:26, 15.73s/it]
 54%|█████▍    | 162/300 [42:26<36:09, 15.72s/it]
 54%|█████▍    | 163/300 [42:41<35:54, 15.72s/it]
 55%|█████▍    | 164/300 [42:57<35:38, 15.72s/it]
 55%|█████▌    | 165/300 [43:13<35:22, 15.72s/it]
 55%|█████▌    | 166/300 [43:29<35:06, 15.72s/it]
 56%|█████▌    | 167/300 [43:44<34:52, 15.74s/it]
 56%|█████▌    | 168/300 [44:00<34:36, 15.73s/it]
 56%|█████▋    | 169/300 [44:16<34:20, 15.73s/it]
 57%|█████▋    | 170/300 [44:32<34:04, 15.73s/it]
 57%|█████▋    | 171/300 [44:47<33:49, 15.73s/it]
 57%|█████▋    | 172/300 [45:03<33:32, 15.72s/it]
 58%|█████▊    | 173/300 [45:19<33:17, 15.73s/it]
 58%|█████▊    | 174/300 [45:34<33:00, 15.72s/it]
 58%|█████▊    | 175/300 [45:50<32:46, 15.73s/it]
 59%|█████▊    | 176/300 [46:06<32:32, 15.74s/it]
 59%|█████▉    | 177/300 [46:22<32:16, 15.74s/it]
 59%|█████▉    | 178/300 [46:37<31:58, 15.73s/it]
 60%|█████▉    | 179/300 [46:53<31:43, 15.73s/it]
 60%|██████    | 180/300 [47:09<31:27, 15.73s/it]
 60%|██████    | 181/300 [47:25<31:12, 15.73s/it]
 61%|██████    | 182/300 [47:40<30:56, 15.73s/it]
 61%|██████    | 183/300 [47:56<30:40, 15.73s/it]
 61%|██████▏   | 184/300 [48:12<30:25, 15.74s/it]
 62%|██████▏   | 185/300 [48:28<30:09, 15.73s/it]
 62%|██████▏   | 186/300 [48:43<29:54, 15.74s/it]
 62%|██████▏   | 187/300 [48:59<29:38, 15.74s/it]
 63%|██████▎   | 188/300 [49:15<29:23, 15.74s/it]
 63%|██████▎   | 189/300 [49:31<29:07, 15.74s/it]
 63%|██████▎   | 190/300 [49:46<28:50, 15.73s/it]
 64%|██████▎   | 191/300 [50:02<28:34, 15.73s/it]
 64%|██████▍   | 192/300 [50:18<28:18, 15.73s/it]
 64%|██████▍   | 193/300 [50:33<28:02, 15.72s/it]
 65%|██████▍   | 194/300 [50:49<27:46, 15.72s/it]
 65%|██████▌   | 195/300 [51:05<27:32, 15.74s/it]
 65%|██████▌   | 196/300 [51:21<27:16, 15.73s/it]
 66%|██████▌   | 197/300 [51:36<27:01, 15.74s/it]
 66%|██████▌   | 198/300 [51:52<26:45, 15.74s/it]
 66%|██████▋   | 199/300 [52:08<26:29, 15.74s/it]
 67%|██████▋   | 200/300 [52:24<26:14, 15.74s/it]
 67%|██████▋   | 201/300 [52:39<25:57, 15.74s/it]
 67%|██████▋   | 202/300 [52:55<25:41, 15.73s/it]
 68%|██████▊   | 203/300 [53:11<25:25, 15.73s/it]
 68%|██████▊   | 204/300 [53:26<25:09, 15.72s/it]
 68%|██████▊   | 205/300 [53:42<24:53, 15.72s/it]
 69%|██████▊   | 206/300 [53:58<24:37, 15.72s/it]
 69%|██████▉   | 207/300 [54:14<24:21, 15.72s/it]
 69%|██████▉   | 208/300 [54:29<24:06, 15.72s/it]
 70%|██████▉   | 209/300 [54:45<23:50, 15.72s/it]
 70%|███████   | 210/300 [55:01<23:35, 15.72s/it]
 70%|███████   | 211/300 [55:17<23:19, 15.73s/it]
 71%|███████   | 212/300 [55:32<23:04, 15.73s/it]
 71%|███████   | 213/300 [55:48<22:48, 15.73s/it]
 71%|███████▏  | 214/300 [56:04<22:31, 15.72s/it]
 72%|███████▏  | 215/300 [56:19<22:15, 15.72s/it]
 72%|███████▏  | 216/300 [56:35<22:02, 15.74s/it]
 72%|███████▏  | 217/300 [56:51<21:45, 15.73s/it]
 73%|███████▎  | 218/300 [57:07<21:30, 15.74s/it]
 73%|███████▎  | 219/300 [57:22<21:14, 15.74s/it]
 73%|███████▎  | 220/300 [57:38<20:59, 15.74s/it]
 74%|███████▎  | 221/300 [57:54<20:44, 15.75s/it]
 74%|███████▍  | 222/300 [58:10<20:28, 15.75s/it]
 74%|███████▍  | 223/300 [58:25<20:13, 15.76s/it]
 75%|███████▍  | 224/300 [58:41<19:56, 15.75s/it]
 75%|███████▌  | 225/300 [58:57<19:40, 15.74s/it]
 75%|███████▌  | 226/300 [59:13<19:24, 15.74s/it]
 76%|███████▌  | 227/300 [59:28<19:09, 15.74s/it]
 76%|███████▌  | 228/300 [59:44<18:53, 15.74s/it]
 76%|███████▋  | 229/300 [1:00:00<18:37, 15.74s/it]
 77%|███████▋  | 230/300 [1:00:16<18:22, 15.74s/it]
 77%|███████▋  | 231/300 [1:00:31<18:06, 15.75s/it]
 77%|███████▋  | 232/300 [1:00:47<17:51, 15.75s/it]
 78%|███████▊  | 233/300 [1:01:03<17:35, 15.75s/it]
 78%|███████▊  | 234/300 [1:01:19<17:19, 15.75s/it]
 78%|███████▊  | 235/300 [1:01:34<17:03, 15.75s/it]
 79%|███████▊  | 236/300 [1:01:50<16:47, 15.74s/it]
 79%|███████▉  | 237/300 [1:02:06<16:31, 15.74s/it]
 79%|███████▉  | 238/300 [1:02:22<16:15, 15.74s/it]
 80%|███████▉  | 239/300 [1:02:37<15:59, 15.74s/it]
 80%|████████  | 240/300 [1:02:53<15:44, 15.74s/it]
 80%|████████  | 241/300 [1:03:09<15:28, 15.73s/it]
 81%|████████  | 242/300 [1:03:24<15:12, 15.73s/it]
 81%|████████  | 243/300 [1:03:40<14:56, 15.73s/it]
 81%|████████▏ | 244/300 [1:03:56<14:40, 15.72s/it]
 82%|████████▏ | 245/300 [1:04:12<14:24, 15.72s/it]
 82%|████████▏ | 246/300 [1:04:27<14:09, 15.72s/it]
 82%|████████▏ | 247/300 [1:04:43<13:53, 15.72s/it]
 83%|████████▎ | 248/300 [1:04:59<13:37, 15.73s/it]
 83%|████████▎ | 249/300 [1:05:15<13:22, 15.74s/it]
 83%|████████▎ | 250/300 [1:05:30<13:07, 15.74s/it]
 84%|████████▎ | 251/300 [1:05:46<12:51, 15.74s/it]
 84%|████████▍ | 252/300 [1:06:02<12:35, 15.73s/it]
 84%|████████▍ | 253/300 [1:06:18<12:19, 15.73s/it]
 85%|████████▍ | 254/300 [1:06:33<12:03, 15.73s/it]
 85%|████████▌ | 255/300 [1:06:49<11:48, 15.74s/it]
 85%|████████▌ | 256/300 [1:07:05<11:32, 15.74s/it]
 86%|████████▌ | 257/300 [1:07:20<11:16, 15.73s/it]
 86%|████████▌ | 258/300 [1:07:36<11:00, 15.74s/it]
 86%|████████▋ | 259/300 [1:07:52<10:45, 15.73s/it]
 87%|████████▋ | 260/300 [1:08:08<10:29, 15.73s/it]
 87%|████████▋ | 261/300 [1:08:23<10:13, 15.73s/it]
 87%|████████▋ | 262/300 [1:08:39<09:57, 15.73s/it]
 88%|████████▊ | 263/300 [1:08:55<09:42, 15.75s/it]
 88%|████████▊ | 264/300 [1:09:11<09:26, 15.74s/it]
 88%|████████▊ | 265/300 [1:09:26<09:11, 15.75s/it]
 89%|████████▊ | 266/300 [1:09:42<08:55, 15.75s/it]
 89%|████████▉ | 267/300 [1:09:58<08:39, 15.76s/it]
 89%|████████▉ | 268/300 [1:10:14<08:23, 15.75s/it]
 90%|████████▉ | 269/300 [1:10:29<08:08, 15.74s/it]
 90%|█████████ | 270/300 [1:10:45<07:52, 15.74s/it]
 90%|█████████ | 271/300 [1:11:01<07:36, 15.74s/it]
 91%|█████████ | 272/300 [1:11:17<07:20, 15.74s/it]
 91%|█████████ | 273/300 [1:11:32<07:05, 15.74s/it]
 91%|█████████▏| 274/300 [1:11:48<06:49, 15.73s/it]
 92%|█████████▏| 275/300 [1:12:04<06:33, 15.73s/it]
 92%|█████████▏| 276/300 [1:12:19<06:17, 15.72s/it]
 92%|█████████▏| 277/300 [1:12:35<06:01, 15.73s/it]
 93%|█████████▎| 278/300 [1:12:51<05:46, 15.73s/it]
 93%|█████████▎| 279/300 [1:13:07<05:30, 15.74s/it]
 93%|█████████▎| 280/300 [1:13:22<05:14, 15.73s/it]
 94%|█████████▎| 281/300 [1:13:38<04:58, 15.73s/it]
 94%|█████████▍| 282/300 [1:13:54<04:42, 15.72s/it]
 94%|█████████▍| 283/300 [1:14:10<04:27, 15.72s/it]
 95%|█████████▍| 284/300 [1:14:25<04:11, 15.73s/it]
 95%|█████████▌| 285/300 [1:14:41<03:55, 15.72s/it]
 95%|█████████▌| 286/300 [1:14:57<03:40, 15.72s/it]
 96%|█████████▌| 287/300 [1:15:12<03:24, 15.72s/it]
 96%|█████████▌| 288/300 [1:15:28<03:08, 15.73s/it]
 96%|█████████▋| 289/300 [1:15:44<02:52, 15.73s/it]
 97%|█████████▋| 290/300 [1:16:00<02:37, 15.72s/it]
 97%|█████████▋| 291/300 [1:16:15<02:21, 15.72s/it]
 97%|█████████▋| 292/300 [1:16:31<02:05, 15.73s/it]
 98%|█████████▊| 293/300 [1:16:47<01:50, 15.73s/it]
 98%|█████████▊| 294/300 [1:17:03<01:34, 15.72s/it]
 98%|█████████▊| 295/300 [1:17:18<01:18, 15.73s/it]
 99%|█████████▊| 296/300 [1:17:34<01:02, 15.73s/it]
 99%|█████████▉| 297/300 [1:17:50<00:47, 15.73s/it]
 99%|█████████▉| 298/300 [1:18:05<00:31, 15.73s/it]
100%|█████████▉| 299/300 [1:18:21<00:15, 15.72s/it]
100%|██████████| 300/300 [1:18:37<00:00, 15.74s/it]
100%|██████████| 300/300 [1:18:37<00:00, 15.72s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  4717.48   
Total input tokens:                      21011700  
Total generated tokens:                  450000    
Request throughput (req/s):              0.06      
Output token throughput (tok/s):         95.39     
Peak output token throughput (tok/s):    113.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          4549.40   
---------------Time to First Token----------------
Mean TTFT (ms):                          2265.26   
Median TTFT (ms):                        2271.20   
P95 TTFT (ms):                           2298.66   
P99 TTFT (ms):                           2312.95   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          8.98      
Median TPOT (ms):                        8.98      
P95 TPOT (ms):                           9.00      
P99 TPOT (ms):                           9.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           10.75     
Median ITL (ms):                         9.01      
P95 ITL (ms):                            18.04     
P99 ITL (ms):                            18.17     
==================================================